## Plan Result (Sandbox - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * module.prod-internal.azurerm_role_assignment.dnszonecontributer
  * module.public-dns.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.prod-internal.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/frontdoor.sandbox.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/e8a449d6-9269-2791-8c33-df0d0552bab5" -> (known after apply)
      ~ name                                   = "e8a449d6-9269-2791-8c33-df0d0552bab5" -> (known after apply)
      ~ principal_id                           = "6c2d130e-ba66-408a-bdf9-f426a9730923" -> "/groups/6c2d130e-ba66-408a-bdf9-f426a9730923" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.public-dns.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/3e38b707-4fc2-2aa8-3646-660f5a2a7c3c" -> (known after apply)
      ~ name                                   = "3e38b707-4fc2-2aa8-3646-660f5a2a7c3c" -> (known after apply)
      ~ principal_id                           = "6c2d130e-ba66-408a-bdf9-f426a9730923" -> "/groups/6c2d130e-ba66-408a-bdf9-f426a9730923" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1856,"Program":"tfcmt","SHA1":"","Target":"Sandbox - TerraformPlanApply","Vars":{}} -->